RT-Thread/rt-thread/bsp/at32/libraries/AT32F435_437_Firmware_Library/drivers/inc/at32f435_437_edma.h
/**
  * @brief dmamux sync id select type
  */
typedef enum
{
  EDMAMUX_SYNC_ID_EXINT0                 = 0x00, /*!< edmamux channel synchronization inputs resources: exint line0 */
  EDMAMUX_SYNC_ID_EXINT1                 = 0x01, /*!< edmamux channel synchronization inputs resources: exint line1 */
  EDMAMUX_SYNC_ID_EXINT2                 = 0x02, /*!< edmamux channel synchronization inputs resources: exint line2 */
  EDMAMUX_SYNC_ID_EXINT3                 = 0x03, /*!< edmamux channel synchronization inputs resources: exint line3 */
  EDMAMUX_SYNC_ID_EXINT4                 = 0x04, /*!< edmamux channel synchronization inputs resources: exint line4 */
  EDMAMUX_SYNC_ID_EXINT5                 = 0x05, /*!< edmamux channel synchronization inputs resources: exint line5 */
  EDMAMUX_SYNC_ID_EXINT6                 = 0x06, /*!< edmamux channel synchronization inputs resources: exint line6 */
  EDMAMUX_SYNC_ID_EXINT7                 = 0x07, /*!< edmamux channel synchronization inputs resources: exint line7 */
  EDMAMUX_SYNC_ID_EXINT8                 = 0x08, /*!< edmamux channel synchronization inputs resources: exint line8 */
  EDMAMUX_SYNC_ID_EXINT9                 = 0x09, /*!< edmamux channel synchronization inputs resources: exint line9 */
  EDMAMUX_SYNC_ID_EXINT10                = 0x0A, /*!< edmamux channel synchronization inputs resources: exint line10 */
  EDMAMUX_SYNC_ID_EXINT11                = 0x0B, /*!< edmamux channel synchronization inputs resources: exint line11 */
  EDMAMUX_SYNC_ID_EXINT12                = 0x0C, /*!< edmamux channel synchronization inputs resources: exint line12 */
  EDMAMUX_SYNC_ID_EXINT13                = 0x0D, /*!< edmamux channel synchronization inputs resources: exint line13 */
  EDMAMUX_SYNC_ID_EXINT14                = 0x0E, /*!< edmamux channel synchronization inputs resources: exint line14 */
  EDMAMUX_SYNC_ID_EXINT15                = 0x0F, /*!< edmamux channel synchronization inputs resources: exint line15 */
  EDMAMUX_SYNC_ID_DMAMUX_CH1_EVT         = 0x10, /*!< edmamux channel synchronization inputs resources: dmamux channel1 event */
  EDMAMUX_SYNC_ID_DMAMUX_CH2_EVT         = 0x11, /*!< edmamux channel synchronization inputs resources: dmamux channel2 event */
  EDMAMUX_SYNC_ID_DMAMUX_CH3_EVT         = 0x12, /*!< edmamux channel synchronization inputs resources: dmamux channel3 event */
  EDMAMUX_SYNC_ID_DMAMUX_CH4_EVT         = 0x13, /*!< edmamux channel synchronization inputs resources: dmamux channel4 event */
  EDMAMUX_SYNC_ID_DMAMUX_CH5_EVT         = 0x14, /*!< edmamux channel synchronization inputs resources: dmamux channel5 event */
  EDMAMUX_SYNC_ID_DMAMUX_CH6_EVT         = 0x15, /*!< edmamux channel synchronization inputs resources: dmamux channel6 event */
  EDMAMUX_SYNC_ID_DMAMUX_CH7_EVT         = 0x16, /*!< edmamux channel synchronization inputs resources: dmamux channel7 event */
  EDMAMUX_SYNC_ID_DMAMUX_CH8_EVT         = 0x17  /*!< edmamux channel synchronization inputs resources: dmamux channel8 event */
} edmamux_sync_id_sel_type;

/**
  * @brief dmamux sync polarity type
  */
typedef enum
{
  EDMAMUX_SYNC_POLARITY_DISABLE          = 0x00, /*!< edmamux channel synchronization inputs resources polarity default value */
  EDMAMUX_SYNC_POLARITY_RISING           = 0x01, /*!< edmamux channel synchronization inputs resources polarity: rising */
  EDMAMUX_SYNC_POLARITY_FALLING          = 0x02, /*!< edmamux channel synchronization inputs resources polarity: falling */
  EDMAMUX_SYNC_POLARITY_RISING_FALLING   = 0x03  /*!< edmamux channel synchronization inputs resources polarity: rising_falling */
} edmamux_sync_pol_type;

/**
  * @brief dmamux generator id select type
  */
typedef enum
{
  EDMAMUX_GEN_ID_EXINT0                  = 0x00, /*!< edmamux generator channel inputs resources: exint line0 */
  EDMAMUX_GEN_ID_EXINT1                  = 0x01, /*!< edmamux generator channel inputs resources: exint line1 */
  EDMAMUX_GEN_ID_EXINT2                  = 0x02, /*!< edmamux generator channel inputs resources: exint line2 */
  EDMAMUX_GEN_ID_EXINT3                  = 0x03, /*!< edmamux generator channel inputs resources: exint line3 */
  EDMAMUX_GEN_ID_EXINT4                  = 0x04, /*!< edmamux generator channel inputs resources: exint line4 */
  EDMAMUX_GEN_ID_EXINT5                  = 0x05, /*!< edmamux generator channel inputs resources: exint line5 */
  EDMAMUX_GEN_ID_EXINT6                  = 0x06, /*!< edmamux generator channel inputs resources: exint line6 */
  EDMAMUX_GEN_ID_EXINT7                  = 0x07, /*!< edmamux generator channel inputs resources: exint line7 */
  EDMAMUX_GEN_ID_EXINT8                  = 0x08, /*!< edmamux generator channel inputs resources: exint line8 */
  EDMAMUX_GEN_ID_EXINT9                  = 0x09, /*!< edmamux generator channel inputs resources: exint line9 */
  EDMAMUX_GEN_ID_EXINT10                 = 0x0A, /*!< edmamux generator channel inputs resources: exint line10 */
  EDMAMUX_GEN_ID_EXINT11                 = 0x0B, /*!< edmamux generator channel inputs resources: exint line11 */
  EDMAMUX_GEN_ID_EXINT12                 = 0x0C, /*!< edmamux generator channel inputs resources: exint line12 */
  EDMAMUX_GEN_ID_EXINT13                 = 0x0D, /*!< edmamux generator channel inputs resources: exint line13 */
  EDMAMUX_GEN_ID_EXINT14                 = 0x0E, /*!< edmamux generator channel inputs resources: exint line14 */
  EDMAMUX_GEN_ID_EXINT15                 = 0x0F, /*!< edmamux generator channel inputs resources: exint line15 */
  EDMAMUX_GEN_ID_DMAMUX_CH1_EVT          = 0x10, /*!< edmamux generator channel inputs resources: dmamux channel1 event */
  EDMAMUX_GEN_ID_DMAMUX_CH2_EVT          = 0x11, /*!< edmamux generator channel inputs resources: dmamux channel2 event */
  EDMAMUX_GEN_ID_DMAMUX_CH3_EVT          = 0x12, /*!< edmamux generator channel inputs resources: dmamux channel3 event */
  EDMAMUX_GEN_ID_DMAMUX_CH4_EVT          = 0x13, /*!< edmamux generator channel inputs resources: dmamux channel4 event */
  EDMAMUX_GEN_ID_DMAMUX_CH5_EVT          = 0x14, /*!< edmamux generator channel inputs resources: dmamux channel5 event */
  EDMAMUX_GEN_ID_DMAMUX_CH6_EVT          = 0x15, /*!< edmamux generator channel inputs resources: dmamux channel6 event */
  EDMAMUX_GEN_ID_DMAMUX_CH7_EVT          = 0x16, /*!< edmamux generator channel inputs resources: dmamux channel7 event */
  EDMAMUX_GEN_ID_DMAMUX_CH8_EVT          = 0x17  /*!< edmamux generator channel inputs resources: dmamux channel8 event */
} edmamux_gen_id_sel_type;

/**
  * @brief dmamux generator polarity type
  */
typedef enum
{
  EDMAMUX_GEN_POLARITY_DISABLE           = 0x00, /*!< edmamux generator channel inputs resources polarity default value */
  EDMAMUX_GEN_POLARITY_RISING            = 0x01, /*!< edmamux generator channel inputs resources polarity: rising */
  EDMAMUX_GEN_POLARITY_FALLING           = 0x02, /*!< edmamux generator channel inputs resources polarity: falling */
  EDMAMUX_GEN_POLARITY_RISING_FALLING    = 0x03  /*!< edmamux generator channel inputs resources polarity: rising_falling */
} edmamux_gen_pol_type;

/**
  * @brief edma init type
  */
typedef struct
{
  uint32_t                               peripheral_base_addr;       /*!< base addrress for peripheral */
  uint32_t                               memory0_base_addr;          /*!< base addrress for memory 0 */
  edma_dir_type                          direction;                  /*!< edma transmit direction, peripheral as source or as destnation  */
  uint16_t                               buffer_size;                /*!< counter to transfer (0~0xFFFF)*/
  confirm_state                          peripheral_inc_enable;      /*!< periphera address increment after one transmit */
  confirm_state                          memory_inc_enable;          /*!< memory address increment after one transmit */
  edma_peripheral_data_size_type         peripheral_data_width;      /*!< peripheral data width for transmit */
  edma_memory_data_size_type             memory_data_width;          /*!< memory data width for transmit */
  confirm_state                          loop_mode_enable;           /*!< when loop mode enable, buffer size will reload if count to 0*/
  edma_priority_level_type               priority;                   /*!< edma priority can choose from very high, high, dedium or low */
  confirm_state                          fifo_mode_enable;           /*!< edma fifo mode enable */
  edma_fifo_threshold_type               fifo_threshold;             /*!< edma fifo threshold vaule */
  edma_memory_burst_type                 memory_burst_mode;          /*!< edma memory burst transfer */
  edma_peripheral_burst_type             peripheral_burst_mode;      /*!< edma peripheral burst transfer */
} edma_init_type;

/**
  * @brief edmamux sync init type
  */
typedef struct
{
  edmamux_sync_id_sel_type               sync_signal_sel;     /*!< edma dmamux synchronization input select */
  edmamux_sync_pol_type                  sync_polarity;       /*!< edma dmamux synchronization polarity */
  uint32_t                               sync_request_number; /*!< edma dmamux number of dma requests before an output event is generated */
  confirm_state                          sync_event_enable;   /*!< edma dmamux event generation disabled */
  confirm_state                          sync_enable;         /*!< edma dmamux synchronization enable */
} edmamux_sync_init_type;

/**
  * @brief edmamux generator init type
  */
typedef struct
{
  edmamux_gen_id_sel_type                gen_signal_sel;     /*!< edma dmamux generator dma request trigger input select */
  edmamux_gen_pol_type                   gen_polarity;       /*!< edma dmamux generator trigger polarity */
  uint32_t                               gen_request_number; /*!< edma dmamux the number of dma requests to be generated after a trigger event */
  confirm_state                          gen_enable;         /*!< edma dmamux generator enable */
} edmamux_gen_init_type;

/**
  * @brief type define edma register all
  */
typedef struct
{
  /**
    * @brief edma sts1 register, offset:0x00
    */
  union
  {
    __IO uint32_t sts1;
    struct
    {
      __IO uint32_t ferrf1               : 1; /* [0] */
      __IO uint32_t reserved1            : 1; /* [1] */
      __IO uint32_t dmerrf1              : 1; /* [2] */
      __IO uint32_t dterrf1              : 1; /* [3] */
      __IO uint32_t hdtf1                : 1; /* [4] */
      __IO uint32_t fdtf1                : 1; /* [5] */
      __IO uint32_t ferrf2               : 1; /* [6] */
      __IO uint32_t reserved2            : 1; /* [7] */
      __IO uint32_t dmerrf2              : 1; /* [8] */
      __IO uint32_t dterrf2              : 1; /* [9] */
      __IO uint32_t hdtf2                : 1; /* [10] */
      __IO uint32_t fdtf2                : 1; /* [11] */
      __IO uint32_t reserved3            : 4; /* [15:13] */
      __IO uint32_t ferrf3               : 1; /* [16] */
      __IO uint32_t reserved4            : 1; /* [17] */
      __IO uint32_t dmerrf3              : 1; /* [18] */
      __IO uint32_t dterrf3              : 1; /* [19] */
      __IO uint32_t hdtf3                : 1; /* [20] */
      __IO uint32_t fdtf3                : 1; /* [21] */
      __IO uint32_t ferrf4               : 1; /* [22] */
      __IO uint32_t reserved5            : 1; /* [23] */
      __IO uint32_t dmerrf4              : 1; /* [24] */
      __IO uint32_t dterrf4              : 1; /* [25] */
      __IO uint32_t hdtf4                : 1; /* [26] */
      __IO uint32_t fdtf4                : 1; /* [27] */
      __IO uint32_t reserved6            : 4; /* [31:28] */
    } sts1_bit;
  };
  /**
    * @brief edma sts2 register, offset:0x04
    */
  union
  {
    __IO uint32_t sts2;
    struct
    {
      __IO uint32_t ferrf5               : 1; /* [0] */
      __IO uint32_t reserved1            : 1; /* [1] */
      __IO uint32_t dmerrf5              : 1; /* [2] */
      __IO uint32_t dterrf5              : 1; /* [3] */
      __IO uint32_t hdtf5                : 1; /* [4] */
      __IO uint32_t fdtf5                : 1; /* [5] */
      __IO uint32_t ferrf6               : 1; /* [6] */
      __IO uint32_t reserved2            : 1; /* [7] */
      __IO uint32_t dmerrf6              : 1; /* [8] */
      __IO uint32_t dterrf6              : 1; /* [9] */
      __IO uint32_t hdtf6                : 1; /* [10] */
      __IO uint32_t fdtf6                : 1; /* [11] */
      __IO uint32_t reserved3            : 4; /* [15:13] */
      __IO uint32_t ferrf7               : 1; /* [16] */
      __IO uint32_t reserved4            : 1; /* [17] */
      __IO uint32_t dmerrf7              : 1; /* [18] */
      __IO uint32_t dterrf7              : 1; /* [19] */
      __IO uint32_t hdtf7                : 1; /* [20] */
      __IO uint32_t fdtf7                : 1; /* [21] */
      __IO uint32_t ferrf8               : 1; /* [22] */
      __IO uint32_t reserved5            : 1; /* [23] */
      __IO uint32_t dmerrf8              : 1; /* [24] */
      __IO uint32_t dterrf8              : 1; /* [25] */
      __IO uint32_t hdtf8                : 1; /* [26] */
      __IO uint32_t fdtf8                : 1; /* [27] */
      __IO uint32_t reserved6            : 4; /* [31:28] */
    } sts2_bit;
  };
  /**
    * @brief edma clr1 register, offset:0x08
    */
  union
  {
    __IO uint32_t clr1;
    struct
    {
      __IO uint32_t ferrfc1              : 1; /* [0] */
      __IO uint32_t reserved1            : 1; /* [1] */
      __IO uint32_t dmerrfc1             : 1; /* [2] */
      __IO uint32_t dterrfc1             : 1; /* [3] */
      __IO uint32_t hdtfc1               : 1; /* [4] */
      __IO uint32_t fdtfc1               : 1; /* [5] */
      __IO uint32_t ferrfc2              : 1; /* [6] */
      __IO uint32_t reserved2            : 1; /* [7] */
      __IO uint32_t dmerrfc2             : 1; /* [8] */
      __IO uint32_t dterrfc2             : 1; /* [9] */
      __IO uint32_t hdtfc2               : 1; /* [10] */
      __IO uint32_t fdtfc2               : 1; /* [11] */
      __IO uint32_t reserved3            : 4; /* [15:13] */
      __IO uint32_t ferrfc3              : 1; /* [16] */
      __IO uint32_t reserved4            : 1; /* [17] */
      __IO uint32_t dmerrfc3             : 1; /* [18] */
      __IO uint32_t dterrfc3             : 1; /* [19] */
      __IO uint32_t hdtfc3               : 1; /* [20] */
      __IO uint32_t fdtfc3               : 1; /* [21] */
      __IO uint32_t ferrfc4              : 1; /* [22] */
      __IO uint32_t reserved5            : 1; /* [23] */
      __IO uint32_t dmerrfc4             : 1; /* [24] */
      __IO uint32_t dterrfc4             : 1; /* [25] */
      __IO uint32_t hdtfc4               : 1; /* [26] */
      __IO uint32_t fdtfc4               : 1; /* [27] */
      __IO uint32_t reserved6            : 4; /* [31:28] */
    } clr1_bit;
  };
  /**
    * @brief edma clr2 register, offset:0x0C
    */
  union
  {
    __IO uint32_t clr2;
    struct
    {
      __IO uint32_t ferrfc5              : 1; /* [0] */
      __IO uint32_t reserved1            : 1; /* [1] */
      __IO uint32_t dmerrfc5             : 1; /* [2] */
      __IO uint32_t dterrfc5             : 1; /* [3] */
      __IO uint32_t hdtfc5               : 1; /* [4] */
      __IO uint32_t fdtfc5               : 1; /* [5] */
      __IO uint32_t ferrfc6              : 1; /* [6] */
      __IO uint32_t reserved2            : 1; /* [7] */
      __IO uint32_t dmerrfc6             : 1; /* [8] */
      __IO uint32_t dterrfc6             : 1; /* [9] */
      __IO uint32_t hdtfc6               : 1; /* [10] */
      __IO uint32_t fdtfc6               : 1; /* [11] */
      __IO uint32_t reserved3            : 4; /* [15:13] */
      __IO uint32_t ferrfc7              : 1; /* [16] */
      __IO uint32_t reserved4            : 1; /* [17] */
      __IO uint32_t dmerrfc7             : 1; /* [18] */
      __IO uint32_t dterrfc7             : 1; /* [19] */
      __IO uint32_t hdtfc7               : 1; /* [20] */
      __IO uint32_t fdtfc7               : 1; /* [21] */
      __IO uint32_t ferrfc8              : 1; /* [22] */
      __IO uint32_t reserved5            : 1; /* [23] */
      __IO uint32_t dmerrfc8             : 1; /* [24] */
      __IO uint32_t dterrfc8             : 1; /* [25] */
      __IO uint32_t hdtfc8               : 1; /* [26] */
      __IO uint32_t fdtfc8               : 1; /* [27] */
      __IO uint32_t reserved6            : 4; /* [31:28] */
    } clr2_bit;
  };

  /**
    * @brief reserved, offset:0x10~0xCC
    */
  __IO uint32_t reserved1[48];

  /**
    * @brief edma link list ctrl register, offset:0xD0
    */
  union
  {
    __IO uint32_t llctrl;
    struct
    {
      __IO uint32_t s1llen               : 1; /* [0] */
      __IO uint32_t s2llen               : 1; /* [1] */
      __IO uint32_t s3llen               : 1; /* [2] */
      __IO uint32_t s4llen               : 1; /* [3] */
      __IO uint32_t s5llen               : 1; /* [4] */
      __IO uint32_t s6llen               : 1; /* [5] */
      __IO uint32_t s7llen               : 1; /* [6] */
      __IO uint32_t s8llen               : 1; /* [7] */
      __IO uint32_t reserved1            : 24;/* [31:8] */
    } llctrl_bit;
  };

  /**
    * @brief reserved, offset:0xD4~0xF0
    */
  __IO uint32_t reserved2[8];

  /**
    * @brief edma 2d ctrl register, offset:0xF4
    */
  union
  {
    __IO uint32_t s2dctrl;
    struct
    {
      __IO uint32_t s12den               : 1; /* [0] */
      __IO uint32_t s22den               : 1; /* [1] */
      __IO uint32_t s32den               : 1; /* [2] */
      __IO uint32_t s42den               : 1; /* [3] */
      __IO uint32_t s52den               : 1; /* [4] */
      __IO uint32_t s62den               : 1; /* [5] */
      __IO uint32_t s72den               : 1; /* [6] */
      __IO uint32_t s82den               : 1; /* [7] */
      __IO uint32_t reserved1            : 24;/* [31:8] */
    } s2dctrl_bit;
  };

  /**
    * @brief reserved, offset:0xF8~0x138
    */
  __IO uint32_t reserved3[17];

  /**
    * @brief edmamux sel register, offset:0x13C
    */
  union
  {
    __IO uint32_t muxsel;
    struct
    {
      __IO uint32_t tblsel               : 1; /* [0] */
      __IO uint32_t reserved1            : 31;/* [31:1] */
    }muxsel_bit;
  };

  /**
    * @brief reserved, offset:0x140~0x16C
    */
  __IO uint32_t reserved4[12];

  /**
    * @brief edmamux syncsts register, offset:0x170
    */
  union
  {
    __IO uint32_t muxsyncsts;
    struct
    {
      __IO uint32_t syncovf              : 8; /* [7:0] */
      __IO uint32_t reserved1            : 24;/* [31:8] */
    }muxsyncsts_bit;
  };

  /**
    * @brief edmamux syncclr register, offset:0x174
    */
  union
  {
    __IO uint32_t muxsyncclr;
    struct
    {
      __IO uint32_t syncovfc             : 8; /* [7:0] */
      __IO uint32_t reserved1            : 24;/* [31:8] */
    }muxsyncclr_bit;
  };

  /**
    * @brief edmamux request generator status register, offset:0x178
    */
  union
  {
    __IO uint32_t muxgsts;
    struct
    {
      __IO uint32_t trgovf               : 4; /* [3:0] */
      __IO uint32_t reserved1            : 28;/* [31:4] */
    }muxgsts_bit;
  };

  /**
    * @brief edmamux request generator status clear register, offset:0x17C
    */
  union
  {
    __IO uint32_t muxgclr;
    struct
    {
      __IO uint32_t trgovfc              : 4; /* [3:0] */
      __IO uint32_t reserved1            : 28;/* [31:4] */
    }muxgclr_bit;
  };

