RT-Thread/rt-thread/bsp/at32/libraries/AT32F435_437_Firmware_Library/drivers/inc/at32f435_437_edma.h
} edma_type;

/**
  * @brief type define edma stream register all
  */
typedef struct
{
  /**
    * @brief edma sxctrl register, offset:0x10+0x18*n n=1...8
    */
  union
  {
    __IO uint32_t ctrl;
    struct
    {
      __IO uint32_t sen                  : 1; /* [0] */
      __IO uint32_t dmerrien             : 1; /* [1] */
      __IO uint32_t dterrien             : 1; /* [2] */
      __IO uint32_t hdtien               : 1; /* [3] */
      __IO uint32_t fdtien               : 1; /* [4] */
      __IO uint32_t pfctrl               : 1; /* [5] */
      __IO uint32_t dtd                  : 2; /* [7:6] */
      __IO uint32_t lm                   : 1; /* [8] */
      __IO uint32_t pincm                : 1; /* [9] */
      __IO uint32_t mincm                : 1; /* [10] */
      __IO uint32_t pwidth               : 2; /* [12:11] */
      __IO uint32_t mwidth               : 2; /* [14:13] */
      __IO uint32_t pincos               : 1; /* [15] */
      __IO uint32_t spl                  : 2; /* [17:16] */
      __IO uint32_t dmm                  : 1; /* [18] */
      __IO uint32_t cm                   : 1; /* [19] */
      __IO uint32_t reserved1            : 1; /* [20] */
      __IO uint32_t pct                  : 2; /* [22:21] */
      __IO uint32_t mct                  : 2; /* [24:23] */
      __IO uint32_t reserved2            : 3; /* [27:25] */
      __IO uint32_t reserved3            : 4; /* [31:28] */
    } ctrl_bit;
  };
  /**
    * @brief edma dtcnt register, offset:0x14+0x18*n n=1...8
    */
  union
  {
    __IO uint32_t dtcnt;
    struct
    {
      __IO uint32_t cnt                  : 16;/* [15:0] */
      __IO uint32_t reserved1            : 16; /*[31:16] */
    } dtcnt_bit;
  };
  /**
    * @brief edma paddr register, offset:0x18+0x18*n n=1...8
    */
  union
  {
    __IO uint32_t paddr;
    struct
    {
      __IO uint32_t paddr                : 32;/* [31:0] */
    } paddr_bit;
  };
  /**
    * @brief edma m0adr register, offset:0x1C+0x18*n n=1...8
    */
  union
  {
    __IO uint32_t m0addr;
    struct
    {
      __IO uint32_t m0addr               : 32;/* [31:0] */
    } m0addr_bit;
  };
  /**
    * @brief edma m1adr register, offset:0x20+0x18*n n=1...8
    */
  union
  {
    __IO uint32_t m1addr;
    struct
    {
      __IO uint32_t m1addr               : 32;/* [31:0] */
    } m1addr_bit;
  };
  /**
    * @brief edma fctrl register, offset:0x24+0x18*n n=1...8
    */
  union
  {
    __IO uint32_t fctrl;
    struct
    {
      __IO uint32_t fthsel               : 2; /* [1:0] */
      __IO uint32_t fen                  : 1; /* [2] */
      __IO uint32_t fsts                 : 3; /* [5:3] */
      __IO uint32_t reserved1            : 1; /* [6] */
      __IO uint32_t ferrien              : 1; /* [7] */
      __IO uint32_t reserved2            : 24;/* [31:8] */
    } fctrl_bit;
  };
} edma_stream_type;

/**
  * @brief type define edma stream link list pointer register
  */
typedef struct
{
  /**
    * @brief edma stream link list pointer register
    */
  union
  {
    __IO uint32_t llp;
    struct
    {
      __IO uint32_t llp                  : 32;/* [31:0] */
    } llp_bit;
  };
} edma_stream_link_list_type;

/**
  * @brief type define edma 2d register all
  */
typedef struct
{
  /**
    * @brief edma s2dcnt register, offset:0x00
    */
  union
  {
    __IO uint32_t s2dcnt;
    struct
    {
      __IO uint32_t xcnt                 : 16;/* [15:0] */
      __IO uint32_t ycnt                 : 16;/* [31:16] */
    } s2dcnt_bit;
  };
  /**
    * @brief edma stride register, offset:0x04
    */
  union
  {
    __IO uint32_t stride;
    struct
    {
      __IO uint32_t srcstd               : 16;/* [15:0] */
      __IO uint32_t dststd               : 16;/* [31:16] */
    } stride_bit;
  };
} edma_stream_2d_type;

/**
  * @brief type define edmamux muxsctrl register
  */
typedef struct
{
  /**
    * @brief edma muxsctrl register
    */
  union
  {
    __IO uint32_t muxctrl;
    struct
    {
      __IO uint32_t reqsel               : 7; /* [6:0] */
      __IO uint32_t reserved1            : 1; /* [7] */
      __IO uint32_t syncovien            : 1; /* [8] */
      __IO uint32_t evtgen               : 1; /* [9] */
      __IO uint32_t reserved2            : 6; /* [15:10] */
      __IO uint32_t syncen               : 1; /* [16] */
      __IO uint32_t syncpol              : 2; /* [18:17] */
      __IO uint32_t reqcnt               : 5; /* [23:19] */
      __IO uint32_t syncsel              : 5; /* [28:24] */
      __IO uint32_t reserved3            : 3; /* [31:29] */
    }muxctrl_bit;
  };
} edmamux_channel_type;

/**
  * @brief type define edmamux request generator register all
  */
typedef struct
{
  /**
    * @brief edmamux request generator register, offset:0x160+n*4 n=1...8
    */
  union
  {
    __IO uint32_t gctrl;
    struct
    {
      __IO uint32_t sigsel               : 5; /* [4:0] */
      __IO uint32_t reserved1            : 3; /* [7:5] */
      __IO uint32_t trgovien             : 1; /* [8] */
      __IO uint32_t reserved2            : 7; /* [15:9] */
      __IO uint32_t gen                  : 1; /* [16] */
      __IO uint32_t gpol                 : 2; /* [18:17] */
      __IO uint32_t greqcnt              : 5; /* [23:19] */
      __IO uint32_t reserved3            : 8; /* [31:24] */
    }gctrl_bit;
  };
} edmamux_generator_type;

/**
  * @}
  */

#define EDMA                             ((edma_type *) EDMA_BASE)
#define EDMA_STREAM1                     ((edma_stream_type *) EDMA_STREAM1_BASE)
#define EDMA_STREAM2                     ((edma_stream_type *) EDMA_STREAM2_BASE)
#define EDMA_STREAM3                     ((edma_stream_type *) EDMA_STREAM3_BASE)
#define EDMA_STREAM4                     ((edma_stream_type *) EDMA_STREAM4_BASE)
#define EDMA_STREAM5                     ((edma_stream_type *) EDMA_STREAM5_BASE)
#define EDMA_STREAM6                     ((edma_stream_type *) EDMA_STREAM6_BASE)
#define EDMA_STREAM7                     ((edma_stream_type *) EDMA_STREAM7_BASE)
#define EDMA_STREAM8                     ((edma_stream_type *) EDMA_STREAM8_BASE)

#define EDMA_STREAM1_2D                  ((edma_stream_2d_type *) EDMA_STREAM1_2D_BASE)
#define EDMA_STREAM2_2D                  ((edma_stream_2d_type *) EDMA_STREAM2_2D_BASE)
#define EDMA_STREAM3_2D                  ((edma_stream_2d_type *) EDMA_STREAM3_2D_BASE)
#define EDMA_STREAM4_2D                  ((edma_stream_2d_type *) EDMA_STREAM4_2D_BASE)
#define EDMA_STREAM5_2D                  ((edma_stream_2d_type *) EDMA_STREAM5_2D_BASE)
#define EDMA_STREAM6_2D                  ((edma_stream_2d_type *) EDMA_STREAM6_2D_BASE)
#define EDMA_STREAM7_2D                  ((edma_stream_2d_type *) EDMA_STREAM7_2D_BASE)
#define EDMA_STREAM8_2D                  ((edma_stream_2d_type *) EDMA_STREAM8_2D_BASE)

